HexagonalArchitecture/SoapAdapter/src/main/resources/getUserByLogin.xml

<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body xmlns:ns2="http://api.soap.tks.java.pl/">
        <ns2:getUserByLogin>
            <arg0>rodzyn123</arg0>
        </ns2:getUserByLogin>
    </S:Body>
</S:Envelope>